[
  {
    "researchgate_id": "392756027",
    "status": "NOT_FOUND",
    "title": "The Impact of High-Frequency Trading on Market Liquidity: A Mathematical Approach",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "356083585",
    "status": "NOT_FOUND",
    "title": "FinRL-Podracer: High Performance and Scalable Deep Reinforcement Learning for Quantitative Finance",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "369612117",
    "status": "NOT_FOUND",
    "title": "A Survey of Quantitative Trading Based on Artificial Intelligence",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "397926147",
    "status": "NOT_FOUND",
    "title": "Automated Decision Making for Trading: A Comparative Analysis of Supervised and Reinforcement Learning",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "367019677",
    "status": "FOUND_PDF",
    "title": "Quant 4.0: engineering quantitative investment with automated, explainable, and knowledge-driven artificial intelligence",
    "abstract": "Quantitative investment (abbreviated as “quant” in this paper) is an interdisciplinary field combining financial engineering, computer science, mathematics, statistics, etc. Quant has become one of the mainstream investment methodologies over the past decades, and has experienced three generations: quant 1.0, trading by mathematical modeling to discover mis-priced assets in markets; quant 2.0, shifting the quant research pipeline from small “strategy workshops” to large “alpha factories”; quant 3.0, applying deep learning techniques to discover complex nonlinear pricing rules. Despite its advantage in prediction, deep learning relies on extremely large data volume and labor-intensive tuning of “black-box” neural network models. To address these limitations, in this paper, we introduce quant 4.0 and provide an engineering perspective for next-generation quant. Quant 4.0 has three key differentiating components. First, automated artificial intelligence (AI) changes the quant pipeline from traditional hand-crafted modeling to state-of-the-art automated modeling and employs the philosophy of “algorithm produces algorithm, model builds model, and eventually AI creates AI.” Second, explainable AI develops new techniques to better understand and interpret investment decisions made by machine learning black boxes, and explains complicated and hidden risk exposures. Third, knowledge-driven AI supplements data-driven AI such as deep learning and incorporates prior knowledge into modeling to improve investment decisions, in particular for quantitative value investing. Putting all these together, we discuss how to build a system that practices the quant 4.0 concept. We also discuss the application of large language models in quantitative finance. Finally, we propose 10 challenging research problems for quant technology, and discuss potential solutions, research directions, and future trends.",
    "pdf_url": "",
    "authors": [
      "Jian Guo",
      "Sai Wang",
      "L. Ni",
      "H. Shum"
    ],
    "year": 2022,
    "citations": 16,
    "doi": "10.1631/FITEE.2300720",
    "semantic_scholar_id": "497a1accfd0be6cad1be4f2b6fa88078dae7414a"
  },
  {
    "researchgate_id": "348261598",
    "status": "FOUND_PDF",
    "title": "Automated Creation of a High-Performing Algorithmic Trader via Deep Learning on Level-2 Limit Order Book Data",
    "abstract": "We present results demonstrating that an appropriately configured deep learning neural network (DLNN) can automatically learn to be a high-performing algorithmic trading system, operating purely from training-data inputs generated by passive observation of an existing successful trader T. That is, we can point our black-box DLNN system at trader T and successfully have it learn from T’s trading activity, such that it trades at least as well as T. Our system, called DeepTrader, takes inputs derived from Level-2 market data, i.e. the market’s Limit Order Book (LOB) or Ladder for a tradeable asset. Unusually, DeepTrader makes no explicit prediction of future prices. Instead, we train it purely on input-output pairs where in each pair the input is a snapshot S of Level-2 LOB data taken at the time when T issued a quote Q (i.e. a bid or an ask order) to the market; and DeepTrader’s desired output is to produce Q when it is shown S. That is, we train our DLNN by showing it the LOB data S that T saw at the time when T issued quote Q, and in doing so our system comes to behave like T, acting as an algorithmic trader issuing specific quotes in response to specific LOB conditions. We train DeepTrader on large numbers of these ${S/Q}$} snapshot/quote pairs, and then test it in a variety of market scenarios, evaluating it against other algorithmic trading systems in the public-domain literature, including two that have repeatedly been shown to outperform human traders. Our results demonstrate that DeepTrader learns to match or outperform such existing algorithmic trading systems. We analyse the successful DeepTrader network to identify what features it is relying on, and which features can be ignored. We propose that our methods can in principle create an explainable copy of an arbitrary trader T via “black-box” deep learning methods.",
    "pdf_url": "https://arxiv.org/pdf/2012.00821",
    "authors": [
      "A. Wray",
      "Matthew Meades",
      "D. Cliff"
    ],
    "year": 2020,
    "citations": 5,
    "doi": "10.1109/SSCI47803.2020.9308266",
    "semantic_scholar_id": "f1065d2e2be814fa9ca0e787ceacaedacdf1b7a2"
  },
  {
    "researchgate_id": "376601031",
    "status": "NOT_FOUND",
    "title": "Quantitative Trading Wizardry: Crafting a Winning Robot",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "397426198",
    "status": "FOUND_PDF",
    "title": "Automate Strategy Finding with LLM in Quant investment",
    "abstract": "We present a novel three-stage framework leveraging Large Language Models (LLMs) within a risk-aware multi-agent system for automate strategy finding in quantitative finance. Our approach addresses the brittleness of traditional deep learning models in financial applications by: employing prompt-engineered LLMs to generate executable alpha factor candidates across diverse financial data, implementing multimodal agent-based evaluation that filters factors based on market status, predictive quality while maintaining category balance, and deploying dynamic weight optimization that adapts to market conditions. Experimental results demonstrate the robust performance of the strategy in Chinese&US market regimes compared to established benchmarks. Our work extends LLMs capabilities to quantitative trading, providing a scalable architecture for financial signal extraction and portfolio construction. The overall framework significantly outperforms all benchmarks with 53.17% cumulative return on SSE50 (Jan 2023 to Jan 2024), demonstrating superior risk-adjusted performance and downside protection on the market.",
    "pdf_url": "",
    "authors": [
      "Zhizhuo Kou",
      "Holam Yu",
      "Jingshu Peng",
      "Lei Chen"
    ],
    "year": 2024,
    "citations": 22,
    "doi": "10.48550/arXiv.2409.06289",
    "semantic_scholar_id": "1b31930e05ba75daf9dafb409242b53af663db66"
  },
  {
    "researchgate_id": "383917934",
    "status": "FOUND_PDF",
    "title": "Automate Strategy Finding with LLM in Quant investment",
    "abstract": "We present a novel three-stage framework leveraging Large Language Models (LLMs) within a risk-aware multi-agent system for automate strategy finding in quantitative finance. Our approach addresses the brittleness of traditional deep learning models in financial applications by: employing prompt-engineered LLMs to generate executable alpha factor candidates across diverse financial data, implementing multimodal agent-based evaluation that filters factors based on market status, predictive quality while maintaining category balance, and deploying dynamic weight optimization that adapts to market conditions. Experimental results demonstrate the robust performance of the strategy in Chinese&US market regimes compared to established benchmarks. Our work extends LLMs capabilities to quantitative trading, providing a scalable architecture for financial signal extraction and portfolio construction. The overall framework significantly outperforms all benchmarks with 53.17% cumulative return on SSE50 (Jan 2023 to Jan 2024), demonstrating superior risk-adjusted performance and downside protection on the market.",
    "pdf_url": "",
    "authors": [
      "Zhizhuo Kou",
      "Holam Yu",
      "Jingshu Peng",
      "Lei Chen"
    ],
    "year": 2024,
    "citations": 22,
    "doi": "10.48550/arXiv.2409.06289",
    "semantic_scholar_id": "1b31930e05ba75daf9dafb409242b53af663db66"
  },
  {
    "researchgate_id": "387992428",
    "status": "FOUND_PDF",
    "title": "AI-Driven Optimization of Financial Quantitative Trading Algorithms and Enhancement of Market Forecasting Capabilities",
    "abstract": "Abstract: The application of artificial intelligence (AI) into financial markets has revolutionised quantitative trading and market forecasting by increasing the efficiency of algorithmic trading, improving the accuracy of market predictions and facilitating real-time market decisions. This paper will provide an overview of the application of Al in the financial markets focusing on the use of machine learning (ML), deep learning (DL) and reinforcement learning (RL) in optimizing the trading algorithms, specifically the capability of Al to process very high data points and complex relationships that other quantitative models are unable to capture. We will discuss trading algorithms such as XGBoost, deep neural networks such as long short-term memory (LSTM) networks and convolutional neural networks (CNNs), how they can outperform traditional quantitative trading models and real-time decision making in stock price prediction, pattern recognition and trading strategy optimisation. We will also look at Al-enhanced predictive models that utilise deep learning and layered models, such as Natural language processing (NLP) sentiment analysis to capture the public sentiment in the market to forecast employing diverse datasets such as historical prices, market volatility, macroeconomic factors and social media sentiment to improve the forecasting accuracy. By going through several experiments and case studies, this paper will shed light on the impact of entrusting quantitative trading and market forecasting decisions to AI for improved performance and reduced errors. There are many challenges ahead but AI plays a constructive role in improving the trading strategies and forecasting market outcomes accurately.",
    "pdf_url": "https://www.ewadirect.com/proceedings/ace/article/view/17278/pdf",
    "authors": [
      "Rufeng Leng"
    ],
    "year": 2024,
    "citations": 3,
    "doi": "10.54254/2755-2721/100/20251742",
    "semantic_scholar_id": "090d13e6d4104dd69e633af2f572281ba5bc3fcc"
  },
  {
    "researchgate_id": "393237783",
    "status": "FOUND_PDF",
    "title": "Deep learning for algorithmic trading: A systematic review of predictive models and optimization strategies",
    "abstract": null,
    "pdf_url": "",
    "authors": [
      "Md Shahriar Mahmud Bhuiyan",
      "Md Al Rafi",
      "Gourab Nicholas Rodrigues",
      "Md Nazmul Hossain Mir",
      "A. Ishraq",
      "M. F. Mridha",
      "Jungpil Shin"
    ],
    "year": 2025,
    "citations": 19,
    "doi": "10.1016/j.array.2025.100390",
    "semantic_scholar_id": "6862292af7c73d82782e1b54e1924aac6fb1ae08"
  },
  {
    "researchgate_id": "366804382",
    "status": "NOT_FOUND",
    "title": "Optimizing Automated Trading Systems with Deep Reinforcement Learning",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "395841128",
    "status": "FOUND_PDF",
    "title": "Design and Implementation of a Multi-Strategy Algorithmic Trading Bot",
    "abstract": "The financial markets require speed and accuracy, and thus, the quick take-up of algorithmic trading systems has ensued. This study presents a hybrid trading bot based on machine learning algorithms and technical indicators such as Moving Average (MA) and Relative Strength Index (RSI). The integration of Random Forest significantly improved signal accuracy and reduced false positives. Back testing over 1 yearshowed a win rate of 73.2% and a return on investment (ROI) of 42.5%, confirming the effectiveness of the hybrid model. The bot is designed to analyze the market in real-time, and it makes trades autonomously, regulates risk, and adjusts to volatile markets.",
    "pdf_url": "",
    "authors": [
      "Shahzeb khan",
      "Zawar Ahmed Khan",
      "Saif Ur Rehman",
      "Arbab Masood Ahmad"
    ],
    "year": 2025,
    "citations": 0,
    "doi": "10.33411/ijist/20257315331541",
    "semantic_scholar_id": "0ce74f6bef89fb44aaa57892771913d5f79cc09f"
  },
  {
    "researchgate_id": "348647950",
    "status": "FOUND_PDF",
    "title": "mt5se: An Open Source Framework for Building Autonomous Trading Robots",
    "abstract": "Autonomous trading robots have been studied in artificial intelligence area for quite some time. Many AI techniques have been tested for building autonomous agents able to trade financial assets. These initiatives include traditional neural networks, fuzzy logic, reinforcement learning but also more recent approaches like deep neural networks and deep reinforcement learning. Many developers claim to be successful in creating robots with great performance when simulating execution with historical price series, so called backtesting. However, when these robots are used in real markets frequently they present poor performance in terms of risks and return. In this paper, we propose an open source framework (mt5se) that helps the development, backtesting, live testing and real operation of autonomous traders. We built and tested several traders using mt5se. The results indicate that it may help the development of better traders. Furthermore, we discuss the simple architecture that is used in many studies and propose an alternative multiagent architecture. Such architecture separates two main concerns for portfolio manager (PM) : price prediction and capital allocation. More than achieve a high accuracy, a PM should increase profits when it is right and reduce loss when it is wrong. Furthermore, price prediction is highly dependent of asset's nature and history, while capital allocation is dependent only on analyst's prediction performance and assets' correlation. Finally, we discuss some promising technologies in the area.",
    "pdf_url": "",
    "authors": [
      "Paulo André Lima de Castro"
    ],
    "year": 2021,
    "citations": 0,
    "doi": null,
    "semantic_scholar_id": "572b69bd2728fa9a7948c4b11b5e35e03d118bda"
  },
  {
    "researchgate_id": "396542021",
    "status": "FOUND_PDF",
    "title": "AlphaQuanter: An End-to-End Tool-Orchestrated Agentic Reinforcement Learning Framework for Stock Trading",
    "abstract": "While Large Language Model (LLM) agents show promise in automated trading, they still face critical limitations. Prominent multi-agent frameworks often suffer from inefficiency, produce inconsistent signals, and lack the end-to-end optimization required to learn a coherent strategy from market feedback. To address this, we introduce AlphaQuanter, a single-agent framework that uses reinforcement learning (RL) to learn a dynamic policy over a transparent, tool-augmented decision workflow, which empowers a single agent to autonomously orchestrate tools and proactively acquire information on demand, establishing a transparent and auditable reasoning process. Extensive experiments demonstrate that AlphaQuanter achieves state-of-the-art performance on key financial metrics. Moreover, its interpretable reasoning reveals sophisticated strategies, offering novel and valuable insights for human traders. Our code for data acquisition and agent training is publicly available at: https://github.com/AlphaQuanter/AlphaQuanter",
    "pdf_url": "",
    "authors": [
      "Zheye Deng",
      "Jiashu Wang"
    ],
    "year": 2025,
    "citations": 0,
    "doi": "10.48550/arXiv.2510.14264",
    "semantic_scholar_id": "acf01e45c8caa3de4076da78ecf2aff8adc99dca"
  },
  {
    "researchgate_id": "382282374",
    "status": "FOUND_PDF",
    "title": "High-Frequency Quantitative Trading of Digital Currencies Based on Fusion of Deep Reinforcement Learning Models with Evolutionary Strategies",
    "abstract": "High-frequency quantitative trading in the emerging digital currency market poses unique challenges due to the lack of established methods for extracting trading information. This paper proposes a deep evolutionary reinforcement learning (DERL) model that combines deep reinforcement learning with evolutionary strategies to address these challenges. Reinforcement learning is applied to data cleaning and factor extraction from a high-frequency, microscopic viewpoint to quantitatively explain the supply and demand imbalance and to create trading strategies. In order to determine whether the algorithm can successfully extract the significant hidden features in the factors when faced with large and complex high-frequency factors, this paper trains the agent in reinforcement learning using three different learning algorithms, including Q-learning, evolutionary strategies, and policy gradient. The experimental dataset, which contains data on sharp up, sharp down, and continuous oscillation situations, was chosen to test Bitcoin in January-February, September, and November of 2022. According to the experimental results, the evolutionary strategies algorithm achieved returns of 59.18%, 25.14%, and 22.72%, respectively. The results demonstrate that deep reinforcement learning based on the evolutionary strategies outperforms Q-learning and policy gradient concerning risk resistance and return capability. The proposed approach offers a robust and adaptive solution for high-frequency trading in the digital currency market, contributing to the development of effective quantitative trading strategies.",
    "pdf_url": "http://cit.fer.hr/index.php/CIT/article/download/5825/2650",
    "authors": [
      "Yijun He",
      "Bo Xu",
      "Xinpu Su"
    ],
    "year": 2024,
    "citations": 2,
    "doi": "10.20532/cit.2024.1005825",
    "semantic_scholar_id": "ee0578ad1ee1da301ef2b7c8acded6accc3c5ca5"
  },
  {
    "researchgate_id": "385709274",
    "status": "FOUND_PDF",
    "title": "AI-Driven Optimization of Financial Quantitative Trading Algorithms and Enhancement of Market Forecasting Capabilities",
    "abstract": "Abstract: The application of artificial intelligence (AI) into financial markets has revolutionised quantitative trading and market forecasting by increasing the efficiency of algorithmic trading, improving the accuracy of market predictions and facilitating real-time market decisions. This paper will provide an overview of the application of Al in the financial markets focusing on the use of machine learning (ML), deep learning (DL) and reinforcement learning (RL) in optimizing the trading algorithms, specifically the capability of Al to process very high data points and complex relationships that other quantitative models are unable to capture. We will discuss trading algorithms such as XGBoost, deep neural networks such as long short-term memory (LSTM) networks and convolutional neural networks (CNNs), how they can outperform traditional quantitative trading models and real-time decision making in stock price prediction, pattern recognition and trading strategy optimisation. We will also look at Al-enhanced predictive models that utilise deep learning and layered models, such as Natural language processing (NLP) sentiment analysis to capture the public sentiment in the market to forecast employing diverse datasets such as historical prices, market volatility, macroeconomic factors and social media sentiment to improve the forecasting accuracy. By going through several experiments and case studies, this paper will shed light on the impact of entrusting quantitative trading and market forecasting decisions to AI for improved performance and reduced errors. There are many challenges ahead but AI plays a constructive role in improving the trading strategies and forecasting market outcomes accurately.",
    "pdf_url": "https://www.ewadirect.com/proceedings/ace/article/view/17278/pdf",
    "authors": [
      "Rufeng Leng"
    ],
    "year": 2024,
    "citations": 3,
    "doi": "10.54254/2755-2721/100/20251742",
    "semantic_scholar_id": "090d13e6d4104dd69e633af2f572281ba5bc3fcc"
  },
  {
    "researchgate_id": "395587759",
    "status": "FOUND_PDF",
    "title": "LSTM-Based Forex Trading Bot Using Python and MetaTrader 5: Design, Simulation, and Evaluation",
    "abstract": "This paper presents the development of an AI-driven forex trading bot that utilizes a Long Short-Term Memory (LSTM) neural network to forecast short-term price movements and automate trading decisions. The objective of the study is to create a scalable, data-driven system capable of improving trade accuracy using historical USD-JPY price data in conjunction with the MetaTrader 5 platform. The proposed system integrates a time-series preprocessing pipeline, LSTM-based price prediction, and a logic-driven trade simulation model to assess performance under controlled conditions. The model achieved a directional accuracy of 88.4%, a profit accuracy of 78%, and a cumulative simulated profit of USD 797.50 over 100 trades. Additionally, training and validation losses stabilized after 50 epochs, indicating effective learning without overfitting. Visual comparisons between actual and predicted prices further validated the model’s forecasting ability. The results highlight the potential of LSTM models to support intelligent financial automation and provide a foundation for future enhancements, including real-time deployment and hybrid AI-based trading strategies.",
    "pdf_url": "",
    "authors": [
      "Reymark-John Macapanas",
      "Mary Ann Gliefen Bermudo"
    ],
    "year": 2025,
    "citations": 0,
    "doi": "10.31763/iota.v5i3.971",
    "semantic_scholar_id": "bbb5744cfd9af52235b828a6c4dad23ddeecce62"
  },
  {
    "researchgate_id": "354800168",
    "status": "NOT_FOUND",
    "title": "Towards Private On-Chain Algorithmic Trading",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "390737104",
    "status": "NOT_FOUND",
    "title": "Algorithmic Trading Bots Using Artificial Intelligence",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "397370214",
    "status": "FOUND_PDF",
    "title": "Application of Deep Reinforcement Learning in Quantitative Trading",
    "abstract": "With the development of financial technology, quantitative trading has become an important trading method in the market with the help of data and algorithms. However, traditional quantitative trading models exhibit limitations in frequent fluctuations and nonlinear markets. Therefore, this paper reviews the applications of deep reinforcement learning in various areas of quantitative trading. And focuses on high-frequency trading, medium- and long-term asset allocation and timing strategies, as well as cryptocurrency trend forecasting and risk control. This paper's research demonstrates that deep reinforcement learning has strong adaptability and strategy optimization potential in complex and dynamic markets. It can potentially improve returns and risk management. But it still faces some challenges, such as poor interpretability, weak robustness and robustness, as well as high training costs. This paper compares the performance of deep reinforcement learning models with other models and summarizes their advantages and disadvantages. It also recommends that future work on deep reinforcement learning should focus on improving model transparency, establishing risk constraint mechanisms, and optimizing training efficiency to promote the more robust development of intelligent trading systems.",
    "pdf_url": "",
    "authors": [
      "Bokai Ren"
    ],
    "year": 2025,
    "citations": 0,
    "doi": "10.54254/2754-1169/2025.bj28939",
    "semantic_scholar_id": "7d3a535f3f2f0824110e04b36207d6ba1890b803"
  },
  {
    "researchgate_id": "395459365",
    "status": "NOT_FOUND",
    "title": "Design and Evaluation of an AI-based Intelligent Trading Bot for the Foreign Exchange Market",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "383201516",
    "status": "FOUND_PDF",
    "title": "Algorithmic trading and machine learning: Advanced techniques for market prediction and strategy development",
    "abstract": "This paper provides an in-depth examination of advanced techniques in algorithmic trading and machine learning, focusing on their impact on market prediction and trading strategies. As financial markets evolve, the need for sophisticated analytical methods has become paramount to gaining a competitive edge. The study covers a range of techniques including time series analysis, natural language processing (NLP), and deep learning models, highlighting their contributions to enhancing predictive accuracy and trading efficiency. The paper explores the importance of feature engineering, model selection, and risk management in developing robust trading strategies. It also addresses the challenges and limitations inherent in financial modeling, such as data quality, overfitting, and computational complexity. Additionally, the paper examines emerging trends and technologies, including quantum computing, federated learning, and ESG integration, which are poised to shape the future of financial markets. By synthesizing insights from various advanced techniques and their practical applications, this paper offers a comprehensive overview of the current state and future directions of algorithmic trading and machine learning in finance. It underscores the importance of continuous innovation and adaptation in maintaining a competitive advantage in the dynamic landscape of financial trading.",
    "pdf_url": "",
    "authors": [
      "Mayowa Timothy Adesina",
      "Sunday David Esebre",
      "Abdullah Tunde Adewuyi",
      "Moshood Yussuf",
      "Oluwaseun Aaron Adigun",
      "Temitope Dickson Olajide",
      "Comfort Idongesit Michael",
      "Divine ILOH"
    ],
    "year": 2024,
    "citations": 4,
    "doi": "10.30574/wjarr.2024.23.2.2405",
    "semantic_scholar_id": "126e6f70acaad500ae5f308ba6395a6c25469a7f"
  },
  {
    "researchgate_id": "390491406",
    "status": "NOT_FOUND",
    "title": "Optimizing Automated Trading Systems Portfolios with Reinforcement Learning for Risk Control",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "395582308",
    "status": "NOT_FOUND",
    "title": "The Influence of AI-Driven Bots and Algorithmic Trading on Bitcoin Price Volatility During COVID-19",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "387434546",
    "status": "FOUND_PDF",
    "title": "The automatic cryptocurrency trading system using a scalping strategy",
    "abstract": "The study focuses on the development and implementation of an automated system for scalping strategies in cryptocurrency markets. Scalping, a high-frequency trading strategy, aims to generate profits from small price fluctuations. The primary goal of the research is to create an automated trading bot that addresses critical issues such as latency, risk management, scalability, and reliability in real-world market conditions. To achieve this, the following objectives were defined: develop a novel scalping method, implement a software solution to integrate the method into an automated trading system, and evaluate its effectiveness through experimental testing.\nThe research methodology utilized technical indicators, including the Exponential Moving Average (EMA) and Volume Weighted Average Price (VWAP). Pseudocode was created to illustrate the decision-making process, incorporating key parameters such as smoothing factors, time periods, and thresholds for trade execution. The software architecture consists of modules: Binance exchange integration, data collection and management, strategy analysis, trade execution, and historical data storage. Technologies such as PostgreSQL, Redis, WebSocket, and Python libraries (Pandas, NumPy, TA-Lib) were employed to ensure the robustness and efficiency of the system.\nExperiments were conducted using the BTC/USDT trading pair, known for its high liquidity and volatility. The system was tested on hardware featuring an Intel Core i7-10700K processor, 32 GB of RAM, and a 1 Gbps network connection. A comparative analysis between the scalping strategy and a trend-following strategy demonstrated the advantages of scalping in volatile markets. The scalping bot executed 15 trades (13 successful) within two hours, achieving a total profit of 120 USDT.\nPerformance metrics, including latency (15–50 ms), signal processing time, CPU utilization(5–55%), and memory usage (120–2100 MB), were measured. The results confirmed the system's modular architecture and its ability to scale linearly with increasing trading volumes.\nThe findings validate the effectiveness of the proposed method and the reliability of the developed system in real-world conditions. Future research may focus on optimizing algorithms to reduce resource consumption and integrating advanced risk management techniques to enhance performance.",
    "pdf_url": "",
    "authors": [
      "Elisa Beraudo",
      "Yurii Oliinyk"
    ],
    "year": 2024,
    "citations": 0,
    "doi": "10.20535/2786-8729.5.2024.316563",
    "semantic_scholar_id": "1d40c2dc61a7ed639c128220b99a8d4c04eb0b25"
  },
  {
    "researchgate_id": "385748052",
    "status": "NOT_FOUND",
    "title": "Reinforcement Learning Framework for Quantitative Trading",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "353770459",
    "status": "FOUND_PDF",
    "title": "Design and Implementation of a Multi-Strategy Algorithmic Trading Bot",
    "abstract": "The financial markets require speed and accuracy, and thus, the quick take-up of algorithmic trading systems has ensued. This study presents a hybrid trading bot based on machine learning algorithms and technical indicators such as Moving Average (MA) and Relative Strength Index (RSI). The integration of Random Forest significantly improved signal accuracy and reduced false positives. Back testing over 1 yearshowed a win rate of 73.2% and a return on investment (ROI) of 42.5%, confirming the effectiveness of the hybrid model. The bot is designed to analyze the market in real-time, and it makes trades autonomously, regulates risk, and adjusts to volatile markets.",
    "pdf_url": "",
    "authors": [
      "Shahzeb khan",
      "Zawar Ahmed Khan",
      "Saif Ur Rehman",
      "Arbab Masood Ahmad"
    ],
    "year": 2025,
    "citations": 0,
    "doi": "10.33411/ijist/20257315331541",
    "semantic_scholar_id": "0ce74f6bef89fb44aaa57892771913d5f79cc09f"
  },
  {
    "researchgate_id": "375650502",
    "status": "FOUND_PDF",
    "title": "Machine learning-based quantitative trading strategies across different time intervals in the American market",
    "abstract": "Stocks are the most common financial investment products and attract many investors around the world. However, stock price volatility is usually uncontrollable and unpredictable for the individual investor. This research aims to apply different machine learning models to capture the stock price trends from the perspective of individual investors. We consider six traditional machine learning models for prediction: decision tree, support vector machine, bootstrap aggregating, random forest, adaptive boosting, and categorical boosting. Moreover, we propose a framework that uses regression models to obtain predicted values of different moving average changes and converts them into classification problems to generate final predictive results. With this method, we achieve the best average accuracy of 0.9031 from the 20-day change of moving average based on the support vector machine model. Furthermore, we conduct simulation trading experiments to evaluate the performance of this predictive framework and obtain the highest average annualized rate of return of 29.57%.",
    "pdf_url": "https://doi.org/10.3934/qfe.2023028",
    "authors": [
      "Yimeng Wang",
      "Keyue Yan"
    ],
    "year": 2023,
    "citations": 8,
    "doi": "10.3934/qfe.2023028",
    "semantic_scholar_id": "fa69f027e0bc0e71bf29c952b6d6f1af2a47124b"
  },
  {
    "researchgate_id": "396748086",
    "status": "FOUND_PDF",
    "title": "QuantEvolve: Automating Quantitative Strategy Discovery through Multi-Agent Evolutionary Framework",
    "abstract": "Automating quantitative trading strategy development in dynamic markets is challenging, especially with increasing demand for personalized investment solutions. Existing methods often fail to explore the vast strategy space while preserving the diversity essential for robust performance across changing market conditions. We present QuantEvolve, an evolutionary framework that combines quality-diversity optimization with hypothesis-driven strategy generation. QuantEvolve employs a feature map aligned with investor preferences, such as strategy type, risk profile, turnover, and return characteristics, to maintain a diverse set of effective strategies. It also integrates a hypothesis-driven multi-agent system to systematically explore the strategy space through iterative generation and evaluation. This approach produces diverse, sophisticated strategies that adapt to both market regime shifts and individual investment needs. Empirical results show that QuantEvolve outperforms conventional baselines, validating its effectiveness. We release a dataset of evolved strategies to support future research.",
    "pdf_url": "",
    "authors": [
      "Junhyeog Yun",
      "Hyoun Jun Lee",
      "Insu Jeon"
    ],
    "year": 2025,
    "citations": 0,
    "doi": "10.48550/arXiv.2510.18569",
    "semantic_scholar_id": "cfd123dbc9857cf185691b891091446f0c046041"
  },
  {
    "researchgate_id": "394622553",
    "status": "NOT_FOUND",
    "title": "Systematic Review on Algorithmic Trading",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "387162838",
    "status": "FOUND_PDF",
    "title": "Sentiment Analysis on Social Media Network using Machine Learning",
    "abstract": "Artificial Intelligence (AI) and Machine Learning (ML) are transforming investment strategies by enhancing decision-making, risk management, and portfolio optimization. These technologies analyze vast amounts of financial data, identify patterns, and generate predictive insights that help investors make informed decisions. AI-driven algorithms can detect market trends, assess sentiment from news and social media, and execute trades with precision. Additionally, ML models continuously adapt to changing market conditions, reducing human biases and improving efficiency. From robot-advisors to hedge funds leveraging deep learning, AI is revolutionizing asset management, offering more accurate forecasts and smarter trading strategies that redefine traditional investment approaches. The significance of researching the influence of AI and machine learning in investment strategies lies in their transformative impact on financial markets. Machine learning models improve risk assessment, portfolio optimization, and predictive analytics, reducing human bias and enhancing efficiency. As AI reshapes investment landscapes, understanding its implications is crucial for investors, financial institutions, and policymakers. This research provides insights into AI’s potential benefits, challenges, and ethical considerations, ensuring its responsible integration into investment strategies for more informed and effective decision-making. First, a comprehensive literature review will be conducted to understand existing AI-driven investment models and their impact. Data collection will include historical market data, AI-generated trading patterns, and performance metrics of AI-based funds. Statistical and econometric models will be applied to compare AI-based strategies with traditional investment methods. Additionally, expert interviews and case studies of leading AI-powered hedge funds will provide insights into real-world applications. Ethical considerations, algorithmic biases, and regulatory challenges will also be examined. The results will be analyzed using performance metrics like return on investment (ROI), Sharpe ratio, and drawdown’s. This mixed-methods approach will offer a comprehensive understanding of AI’s role in modern investment strategies. Alternative taken as AI-Driven Quantitative Trading, Machine Learning-Based Portfolio Optimization, AI-Powered Robot-Advisors, and Sentiment Analysis for Stock Prediction, Algorithmic High-Frequency Trading (HFT), Reinforcement Learning for Trading, Neural Networks for Market Forecasting, AI-Based Risk Management Models. Evaluation preference taken sari (%), Prediction Accuracy (%), Market Adaptability, Operational Efficiency, Computational Complexity, Implementation Cost. AI-Powered Robot-Advisors is getting first place and Algorithmic High-Frequency Trading is getting last place of the table.",
    "pdf_url": "",
    "authors": [
      "Mohd",
      "Saif Ali",
      "Deepak Kumar"
    ],
    "year": 2025,
    "citations": 0,
    "doi": "10.46632/cset/3/2/16",
    "semantic_scholar_id": "27052e366a20140af7126895c999cd352ce25cd9"
  },
  {
    "researchgate_id": "387168417",
    "status": "NOT_FOUND",
    "title": "The Adoption of Quantitative AI Models in Hedge Fund Management",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "387170050",
    "status": "NOT_FOUND",
    "title": "The Integration of AI in Hedge Fund Investment Strategies",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "377934753",
    "status": "NOT_FOUND",
    "title": "Deep Reinforcement Learning Robots for Algorithmic Trading Considering Stock Market Conditions and US Interest Rates",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "388448293",
    "status": "NOT_FOUND",
    "title": "Algorithmic Trading Bot Using Artificial Intelligence: Supertrend Strategy",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "387169141",
    "status": "NOT_FOUND",
    "title": "AI in Hedge Fund Algorithmic Trading: Challenges and Opportunities",
    "abstract": null,
    "pdf_url": null
  },
  {
    "researchgate_id": "364025503",
    "status": "NOT_FOUND",
    "title": "Automated Cryptocurrency Trading Bot Implementing Deep Reinforcement Learning",
    "abstract": null,
    "pdf_url": null
  }
]